#+SEQ_TODO: TODO STARTED | DONE CANCELLED

** TODO Write thesis
   :LOGBOOK:
   CLOCK: [2021-02-17 Wed 11:58]--[2021-02-17 Wed 14:07] =>  2:09
   :END:
** DONE Port openocd commands to Rust/probe-rs and replicate behavior
   CLOSED: [2021-02-14 Sun 00:23] DEADLINE: <2021-02-11 Thu>
   :LOGBOOK:
   CLOCK: [2021-02-12 Fri 18:15]--[2021-02-12 Fri 18:36] =>  0:21
   CLOCK: [2021-02-12 Fri 16:50]--[2021-02-12 Fri 17:46] =>  0:56
   CLOCK: [2021-02-10 Wed 15:01]--[2021-02-10 Wed 16:39] =>  1:38
   CLOCK: [2021-02-09 Tue 20:20]--[2021-02-09 Tue 21:32] =>  1:12
   CLOCK: [2021-02-09 Tue 18:40]--[2021-02-09 Tue 19:00] =>  0:20
   CLOCK: [2021-02-09 Tue 17:23]--[2021-02-09 Tue 18:22] =>  0:59
   CLOCK: [2021-02-09 Tue 15:03]--[2021-02-09 Tue 16:50] =>  1:47
   CLOCK: [2021-02-08 Mon 22:23]--[2021-02-08 Mon 22:43] =>  0:20
   CLOCK: [2021-02-08 Mon 21:39]--[2021-02-08 Mon 21:53] =>  0:14
   CLOCK: [2021-02-08 Mon 16:16]--[2021-02-08 Mon 19:18] =>  3:02
   :END:
   We want to ditch openocd in favour of ~probe-ps~. This may require
   some changes to the code base because ITM support is presently marked
   as "alpha". In essence, we need to translate whatever openocd does
   OOTB and the gdb commands (?) to a ~probe-rs~ environment.
   - Later these commands will be ported to probe.rs
   - Make sure to find manual references for all commands.

   *Build with symbols and -O0 and reverse engineer script*
   Functions of interest (when running as =openocd -d -f openocd.cfg=):
   - =target_write_u32= in =target.c:2482=
   - =adapter_write_memory= in =hla_target.c:783=
   Breakpoint these and inspect during runtime. Are there any other
   functions that write to target?
   *Must we concern ourselves with what probe-rs already writes?*

   *Below: what openocd does on startup*
   - Debug -302 :: checks CPUID and floating-point features, host-side setup
   - Debug 303-306 :: sets ~DHCSR = 0xa05f0001~; unlocks the register
     with ~0xa05f~ and enables debug-mode.
   - Debug 307-308 :: sets ~DEMCR = 0x01000000~; sets TRCENA: globally
     enables all DWT and ITM units.
   - *We go through Flash Patch and Break (FPB) unit*
   - Debug 309-310 :: reads ~FP_CTRL = 0x00000260~ (Flash Patch control
     register).
   - Debug 311-327 :: (probably) nulls the FPB comparator registers.
   - Debug 328-330 :: reads ~DWT_CTRL = 0x40000000~.
   - Debug 331-333 :: Reads some CoreSight management register (offset
     0xFBC, RO). Some ~DWT_DEVARCH = 0x0~.
   - Debug 334-335 :: Nulls ~DWT_FUNCTIONn~, $n = 0, ... 3$; disables them.
   - Debug 344-353 :: executes ~examine-end~:
     #+BEGIN_SRC tcl
       # Enable debug during low power modes (uses more power)
       # DBGMCU_CR |= DBG_STANDBY | DBG_STOP | DBG_SLEEP
       mmw 0xE0042004 0x00000007 0

       # Stop watchdog counters during halt
       # DBGMCU_APB1_FZ |= DBG_IWDG_STOP | DBG_WWDG_STOP
       mmw 0xE0042008 0x00001800 0
     #+END_SRC
   - Debug 354-377 :: registers internal flash commands. Nothing
     seemingly written to device.
   - Debug 378-380 :: Initializes PLDs (?).
   - Debug 381-382 :: Starts GDB server.
   - Debug 383-- :: Shuts down.

*** DONE Load program
    CLOSED: [2021-02-12 Fri 20:18]
    :LOGBOOK:
    CLOCK: [2021-02-12 Fri 20:19]--[2021-02-12 Fri 20:21] =>  0:02
    CLOCK: [2021-02-12 Fri 19:05]--[2021-02-12 Fri 20:18] =>  1:13
    :END:
    Target flashing is done via =probe_rs_cli_util::download_file=.
    A function like it should be available in ~probe-rs~.

*** DONE Read ITM packets and record to file
    CLOSED: [2021-02-13 Sat 23:10]
    :LOGBOOK:
    CLOCK: [2021-02-13 Sat 22:23]--[2021-02-13 Sat 23:10] =>  0:47
    CLOCK: [2021-02-13 Sat 16:52]--[2021-02-13 Sat 17:16] =>  0:24
    CLOCK: [2021-02-13 Sat 03:23]--[2021-02-13 Sat 04:35] =>  1:12
    CLOCK: [2021-02-12 Fri 18:36]--[2021-02-12 Fri 19:05] =>  0:29
    :END:
    All commands are now ported to our ad-hoc scope. What we need to do
    now is to run the trace example using openocd, copy its debug log
    down below and see what it does to read out the ITM packets from
    STLink.

    After setting everything up and running =continue=:

    ~DEMCR~, Debug Exception and Monitor Control Register. See
    [[pdf:~/exjobb/docs/DDI0403E_B_armv7m_arm.pdf::765++0.01][DDI0403E_B_armv7m_arm.pdf: Page 765]].
    - Sets ~TRCENA~ :: global enable of all DWT and ITM features (again?).
    #+begin_src
    Debug: 1964 22935 gdb_server.c:3267 gdb_input_inner(): received packet: 'vCont?'
    Debug: 1965 22936 gdb_server.c:3267 gdb_input_inner(): received packet: 'vCont;c'
    Debug: 1966 22936 gdb_server.c:2740 gdb_handle_vcont_packet(): target stm32f4x.cpu continue
    Debug: 1967 22936 target.c:1626 target_call_event_callbacks(): target event 3 (resume-start) for core stm32f4x.cpu
    Debug: 1968 22936 hla_target.c:615 adapter_resume(): adapter_resume 1 0x00000000 0 0
    Debug: 1969 22936 target.c:1978 target_free_all_working_areas_restore(): freeing all working areas
    Debug: 1970 22936 target.c:1741 print_wa_layout():    0x20000000-0x20007fff (32768 bytes)
    Debug: 1971 22936 target.c:2482 target_write_u32(): address: 0xe000edfc, value: 0x01000000
    Debug: 1972 22936 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edfc 4 1
    #+end_src

    ~DCRDR~, Debug Core Register Data Register
    - Nulls register :: this is a message passing register. A previous
      write to ~DCRSR.REGSEL~ describes what was nulled here. See
      [[pdf:~/exjobb/docs/DDI0403E_B_armv7m_arm.pdf::763++0.00][DDI0403E_B_armv7m_arm.pdf: Page 763]].
    #+begin_src
    Debug: 1973 22936 armv7m.c:148 armv7m_restore_context():
    Debug: 1974 22936 target.c:2482 target_write_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 1975 22936 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf8 4 1
    #+end_src

    Various register readouts for GDB. Nothing relating to ITM packets.
    #+begin_src
    Debug: 1976 22937 target.c:1626 target_call_event_callbacks(): target event 2 (resumed) for core stm32f4x.cpu
    Debug: 1977 22937 target.c:1626 target_call_event_callbacks(): target event 4 (resume-end) for core stm32f4x.cpu
    Debug: 1978 22937 target.c:1626 target_call_event_callbacks(): target event 7 (gdb-start) for core stm32f4x.cpu
    Debug: 1979 23039 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 1980 23039 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 1981 23039 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1982 23040 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 0  value 0x0
    Debug: 1983 23040 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1984 23041 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 1  value 0x0
    Debug: 1985 23041 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1986 23041 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 2  value 0x8
    Debug: 1987 23041 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1988 23042 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 3  value 0x100
    Debug: 1989 23042 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1990 23042 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 4  value 0x0
    Debug: 1991 23042 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1992 23043 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 5  value 0x0
    Debug: 1993 23043 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1994 23044 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 6  value 0x0
    Debug: 1995 23044 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1996 23044 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 7  value 0x20007f40
    Debug: 1997 23044 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 1998 23045 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 8  value 0x0
    Debug: 1999 23045 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2000 23046 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 9  value 0x0
    Debug: 2001 23046 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2002 23046 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 10  value 0x0
    Debug: 2003 23046 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2004 23047 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 11  value 0x0
    Debug: 2005 23047 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2006 23048 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 12  value 0x0
    Debug: 2007 23048 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2008 23048 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 13  value 0x20007f38
    Debug: 2009 23048 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2010 23049 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 14  value 0x80006d3
    Debug: 2011 23049 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2012 23050 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 15  value 0x8000ae6
    Debug: 2013 23050 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2014 23050 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 16  value 0x61000016
    Debug: 2015 23050 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2016 23051 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 17  value 0x20007f38
    Debug: 2017 23051 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2018 23051 hla_target.c:74 adapter_load_core_reg_u32(): load from core reg 18  value 0x0
    Debug: 2019 23051 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2020 23052 hla_target.c:130 adapter_load_core_reg_u32(): load from special reg 19 value 0x0
    Debug: 2021 23052 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2022 23052 hla_target.c:130 adapter_load_core_reg_u32(): load from special reg 20 value 0x0
    Debug: 2023 23052 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2024 23053 hla_target.c:130 adapter_load_core_reg_u32(): load from special reg 21 value 0x0
    Debug: 2025 23053 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2026 23053 hla_target.c:130 adapter_load_core_reg_u32(): load from special reg 22 value 0x0
    Debug: 2027 23053 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2028 23053 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000040
    Debug: 2029 23054 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2030 23054 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2031 23054 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2032 23054 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S0  value 0x0
    Debug: 2033 23054 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2034 23054 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000041
    Debug: 2035 23054 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2036 23055 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2037 23055 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2038 23055 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S1  value 0x0
    Debug: 2039 23055 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2040 23055 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000042
    Debug: 2041 23055 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2042 23056 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2043 23056 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2044 23056 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S2  value 0x0
    Debug: 2045 23056 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2046 23056 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000043
    Debug: 2047 23056 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2048 23057 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2049 23058 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2050 23058 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S3  value 0x0
    Debug: 2051 23058 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2052 23058 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000044
    Debug: 2053 23058 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2054 23058 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2055 23059 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2056 23059 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S4  value 0x0
    Debug: 2057 23059 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2058 23059 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000045
    Debug: 2059 23059 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2060 23059 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2061 23060 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2062 23060 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S5  value 0x0
    Debug: 2063 23060 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2064 23060 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000046
    Debug: 2065 23060 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2066 23060 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2067 23061 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2068 23061 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S6  value 0x0
    Debug: 2069 23061 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2070 23061 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000047
    Debug: 2071 23061 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2072 23061 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2073 23062 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2074 23062 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S7  value 0x0
    Debug: 2075 23062 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2076 23062 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000048
    Debug: 2077 23062 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2078 23063 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2079 23063 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2080 23063 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S8  value 0x0
    Debug: 2081 23063 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2082 23063 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000049
    Debug: 2083 23063 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2084 23064 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2085 23064 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2086 23064 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S9  value 0x0
    Debug: 2087 23064 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2088 23064 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000004a
    Debug: 2089 23064 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2090 23065 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2091 23066 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2092 23066 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S10  value 0x0
    Debug: 2093 23066 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2094 23066 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000004b
    Debug: 2095 23066 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2096 23066 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2097 23067 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2098 23067 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S11  value 0x0
    Debug: 2099 23067 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2100 23067 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000004c
    Debug: 2101 23067 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2102 23067 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2103 23068 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2104 23068 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S12  value 0x0
    Debug: 2105 23068 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2106 23068 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000004d
    Debug: 2107 23068 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2108 23069 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2109 23069 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2110 23069 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S13  value 0x0
    Debug: 2111 23069 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2112 23069 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000004e
    Debug: 2113 23069 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2114 23070 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2115 23070 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2116 23070 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S14  value 0x0
    Debug: 2117 23070 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2118 23070 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000004f
    Debug: 2119 23070 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2120 23071 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2121 23071 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2122 23072 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S15  value 0x0
    Debug: 2123 23072 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2124 23072 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000050
    Debug: 2125 23072 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2126 23072 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2127 23073 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2128 23073 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S16  value 0x0
    Debug: 2129 23073 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2130 23073 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000051
    Debug: 2131 23073 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2132 23073 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2133 23074 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2134 23074 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S17  value 0x0
    Debug: 2135 23074 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2136 23074 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000052
    Debug: 2137 23074 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2138 23075 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2139 23075 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2140 23075 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S18  value 0x0
    Debug: 2141 23075 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2142 23075 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000053
    Debug: 2143 23075 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2144 23076 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2145 23077 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2146 23077 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S19  value 0x0
    Debug: 2147 23077 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2148 23077 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000054
    Debug: 2149 23077 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2150 23077 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2151 23078 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2152 23078 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S20  value 0x0
    Debug: 2153 23078 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2154 23078 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000055
    Debug: 2155 23078 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2156 23078 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2157 23079 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2158 23079 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S21  value 0x0
    Debug: 2159 23079 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2160 23079 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000056
    Debug: 2161 23079 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2162 23080 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2163 23080 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2164 23080 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S22  value 0x0
    Debug: 2165 23080 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2166 23080 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000057
    Debug: 2167 23080 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2168 23081 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2169 23081 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2170 23081 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S23  value 0x0
    Debug: 2171 23081 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2172 23081 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000058
    Debug: 2173 23081 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2174 23082 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2175 23082 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2176 23083 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S24  value 0x0
    Debug: 2177 23083 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2178 23083 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000059
    Debug: 2179 23083 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2180 23107 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2181 23107 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2182 23107 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S25  value 0x0
    Debug: 2183 23107 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2184 23107 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000005a
    Debug: 2185 23107 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2186 23108 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2187 23108 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2188 23108 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S26  value 0x0
    Debug: 2189 23108 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2190 23108 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000005b
    Debug: 2191 23108 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2192 23109 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2193 23109 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2194 23109 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S27  value 0x0
    Debug: 2195 23109 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2196 23109 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000005c
    Debug: 2197 23109 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2198 23110 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2199 23110 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2200 23110 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S28  value 0x0
    Debug: 2201 23110 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2202 23110 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000005d
    Debug: 2203 23110 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2204 23111 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2205 23112 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2206 23112 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S29  value 0x0
    Debug: 2207 23112 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2208 23112 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000005e
    Debug: 2209 23112 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2210 23112 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2211 23113 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2212 23113 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S30  value 0x0
    Debug: 2213 23113 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2214 23113 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x0000005f
    Debug: 2215 23113 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2216 23114 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2217 23114 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2218 23114 hla_target.c:96 adapter_load_core_reg_u32(): load from FPU reg S31  value 0x0
    Debug: 2219 23114 hla_target.c:59 adapter_load_core_reg_u32(): adapter_load_core_reg_u32
    Debug: 2220 23114 target.c:2482 target_write_u32(): address: 0xe000edf4, value: 0x00000021
    Debug: 2221 23114 hla_target.c:783 adapter_write_memory(): adapter_write_memory 0xe000edf4 4 1
    Debug: 2222 23115 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0xe000edf8 4 1
    Debug: 2223 23115 target.c:2394 target_read_u32(): address: 0xe000edf8, value: 0x00000000
    Debug: 2224 23116 hla_target.c:85 adapter_load_core_reg_u32(): load from FPSCR  value 0x0
    Debug: 2225 23175 hla_target.c:452 adapter_debug_entry(): entered debug state in core mode: Handler at PC 0x08000ae6, target->state: halted
    Debug: 2226 23175 target.c:1626 target_call_event_callbacks(): target event 0 (gdb-halt) for core stm32f4x.cpu
    Debug: 2227 23175 target.c:1626 target_call_event_callbacks(): target event 1 (halted) for core stm32f4x.cpu
    Debug: 2228 23175 target.c:1626 target_call_event_callbacks(): target event 8 (gdb-end) for core stm32f4x.cpu
    Debug: 2229 23175 hla_target.c:497 adapter_poll(): halted: PC: 0x08000ae6
    Debug: 2230 23175 gdb_server.c:3267 gdb_input_inner(): received packet: 'g'
    Debug: 2231 23176 gdb_server.c:3267 gdb_input_inner(): received packet: 'qXfer:threads:read::0,1000'
    Debug: 2232 23176 gdb_server.c:3267 gdb_input_inner(): received packet: 'm8000ae6,4'
    Debug: 2233 23176 gdb_server.c:1456 gdb_read_memory_packet(): addr: 0x0000000008000ae6, len: 0x00000004
    Debug: 2234 23176 target.c:2248 target_read_buffer(): reading buffer of 4 byte at 0x08000ae6
    Debug: 2235 23176 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0x08000ae6 2 2
    Debug: 2236 23178 gdb_server.c:3267 gdb_input_inner(): received packet: 'm8000ae6,2'
    Debug: 2237 23178 gdb_server.c:1456 gdb_read_memory_packet(): addr: 0x0000000008000ae6, len: 0x00000002
    Debug: 2238 23178 target.c:2248 target_read_buffer(): reading buffer of 2 byte at 0x08000ae6
    Debug: 2239 23178 hla_target.c:768 adapter_read_memory(): adapter_read_memory 0x08000ae6 2 1
    #+end_src

    [[file:~/code/openocd/src/jtag/drivers/stlink_usb.c][It's not immidiately obvious how openocd records the ITM packets.]]

    [[file:~/code/probe-rs/probe-rs/src/session.rs::pub fn setup_swv(&mut self, config: &SwoConfig) -> Result<(), Error> {][~probe_rs~ contains some better leads]]: When calling =setup_swv= we
    do three things:
    1. Configure SWO on the probe
       1. +Starts receiving packets, somehow...+ Just tells the probe to
          recv. We may need an external UART adapter to recv ITM packets
          to host. Checkup with matix chat.
    2. Enable tracing on the target
       1. Sets ~DEMCR.TRCENA~
    3. [[file:~/code/probe-rs/probe-rs/src/architecture/arm/component/mod.rs::pub fn setup_swv(][Configure SWV on the target]]
       1. Sets ~DEMCR.TRCENA~
       2. Performs vendor-specific SWV setup
       3. Configures TPIU
       4. Configures ITM
       5. Configures DWT


    From OOTB of ~probe-rs~ with
    #+begin_src rust
      session.setup_swv(
            &SwoConfig::new(16_000_000)
                .set_baud(2_000_000)
                .set_continuous_formatting(false)
      )?;

      flash_program(&mut session)?;

      let mut f = File::create("/tmp/itm.bin")?;
      while let Ok(bytes) = session.read_swo() {
          if bytes.len() > 0 {
              f.write_all(&bytes)?;
          }
      }
    #+end_src
    We recv ITM packets, but seemingly no DWT packets. But if we combine
    the above with all other register writes, we get the exception
    traces.

    This is implemented in probe-rs:
    #+begin_src rust
      session.setup_swv(
          &SwoConfig::new(16_000_000)
              .set_baud(2_000_000)
              .set_continuous_formatting(false)
      )?;

      let component = session.get_arm_component()?;
      let mut core = session.core(0)?;
      Dwt::new(&mut core, &component).enable_exception_trace()?;
    #+end_src

** DONE Fork japaric/itm-tools and rewrite it for ~probe-rs~
   CLOSED: [2021-02-14 Sun 00:36]
   :LOGBOOK:
   CLOCK: [2021-02-13 Sat 23:14]--[2021-02-14 Sun 00:36] =>  1:22
   :END:
   We only concern ourselves with exception tracing for now, so only
   show how that is done.

   Done, see https://github.com/tmplt/itm-tools.

** DONE +Patch probe-rs to properly do exception tracing+
   :LOGBOOK:
   CLOCK: [2021-02-17 Wed 14:16]--[2021-02-17 Wed 15:02] =>  0:46
   :END:
   What does the below do, and how do we fix it for the stm32f401re?
   #+begin_src rust
     let comp = session.get_arm_component()?;
     let mut core = session.core(0)?;
     Dwt::new(&mut core, &comp).enable_exception_trace()?;
   #+end_src
   [[file:~/code/probe-rs/probe-rs/src/architecture/arm/component/dwt.rs::pub fn enable_exception_trace(&mut self) -> Result<(), Error> {][probe-rs source]].
   Only ~EXCTRCENA~ is set.
   ~DWT~ seems like a struct that only touches registers that relate to
   a single feature. =enable_exception_trace()= only sets ~EXCTRCENA~;
   =enable_data_trace()= enables and takes an address to monitor; etc.

   There is ~dwt.rs~ that touches DWT-related registers. Then there is
   ~itm.rs~ that touches ITM-related registers.

   Find an MWE that reproduces exception traces?

   itm-tools debugger reimplemented via probe-rs API. PC sample
   generation must be disabled however. itm-tools decoders do not handle
   exception traces and PC sample types.

** DONE Investigate the ITM decoder in probe-rs
   CLOSED: [2021-02-17 Wed 17:35]
   :LOGBOOK:
   CLOCK: [2021-02-19 Fri 14:30]--[2021-02-19 Fri 14:32] =>  0:02
   CLOCK: [2021-02-17 Wed 16:55]--[2021-02-17 Wed 17:35] =>  0:40
   :END:
   Implements decode for exception traces.

   We can trivially decode ITM packets via the probe-rs decoder.

   - Packets can be sent to any suitable trace sink. It mustn't be the
     TPIU.
   - TPIU forms packets into frames, as per CoreSight architecture spec.
   - TPIU transmits packets in LSB.

** DONE Transmit trace over serial pin (SWO)
   CLOSED: [2021-04-07 Wed 13:41]
   :LOGBOOK:
   CLOCK: [2021-04-07 Wed 12:03]--[2021-04-07 Wed 13:38] =>  1:35
   CLOCK: [2021-04-07 Wed 09:58]--[2021-04-07 Wed 11:22] =>  1:24
   :END:
   STLink does not read all trace bytes from the target, so we must try
   with the serial pin instead. How do we enable it?

   The pin is denoted ~TRACESWO~ in [[pdf:~/exjobb/docs/RM0368.pdf::832++0.00][RM0368.pdf: Page 832]]. It is bound to
   PB3 on the Nucleo.

   - Some "serial wire mode; not in JTAG mode" for async mode (only a
     single wire is used)
   - Set ~TRACE_IOEN~ and ~TRACE_MODE = 0b00~ bits. Pin(s) not assigned
     by default.

   Signal is sent on PB3 with the above configured. Default behavior
   appears to be async pin.

   *What is the baud rate?* It is configured in ~TPIU_ACPR~,
   [[pdf:~/exjobb/docs/DDI0403E_d_armv7m_arm.pdf::752++0.23][DDI0403E_d_armv7m_arm.pdf: Page 752]]. SWO output clock =
   async_reference_clock/(swoscalar + 1).

   The async reference clock, HCLK, is 16MHz by default, so to set a
   115200 baud rate (yielding good bitsteam) prescalar must be set to
   =16_000_000 / 115_200 - 1=. Bitstream is then read via =stty -F
   /dev/ttyUSB3 115200; cat /dev/ttyUSB3 | tee itm.bin | xxd -b=.

   On the host, we need to set the following
   #+begin_src
   speed 9600 baud; line = 0;
   min = 100; time = 2;
   -icrnl -imaxbel
   -opost -onlcr
   -isig -icanon -echo
   #+end_src
   which can be done by calling =screen /dev/ttyUSB3 9600=

** DONE Resolve HW task symbol from IRQ number [3/3]
   CLOSED: [2021-04-20 Tue 16:17]
   :LOGBOOK:
   CLOCK: [2021-04-09 Fri 13:21]--[2021-04-09 Fri 16:04] =>  2:43

   CLOCK: [2021-04-09 Fri 10:35]--[2021-04-09 Fri 12:04] =>  1:29
   :END:
   On an exception trace we get an IRQ number, this should map to NVIC
   offset, which then maps to a HW task symbol.

   - irq2symb
   - tasks may not always map to external interrupts. So we must be able
     to map all exception numbers.
   - The vector table contains the entry point address of each exception
     handler. See [[pdf:~/exjobb/docs/DDI0403E_d_armv7m_arm.pdf::525++0.00][DDI0403E_d_armv7m_arm.pdf: Page 525]].
   - ~VTOR~ register tells us where the table is in memory.


   - How is the data that ends up in the vector table stored in the ELF?
   - Does the NVIC contain the info I think it does?
     - All NVIC interrupts have an assoc exception number as part of the
       ARMv7-M exception model. See [[pdf:~/exjobb/docs/DDI0403E_d_armv7m_arm.pdf::624++0.00][DDI0403E_d_armv7m_arm.pdf: Page 624]].
   - vector_table_addr = VTOR<31:7>:'0000000' exception number N found
     at offset N*0x4.
   - *How long is the table?* Max 496 external interrupts. Read
     ~SCS.ICTR.INTLINESNUM[3:0]~. See [[pdf:~/exjobb/docs/DDI0403E_d_armv7m_arm.pdf::618++0.00][DDI0403E_d_armv7m_arm.pdf: Page
     618]]. Number of interrupt lines is max(32 * (INTLINESNUM + 1), 496).
** TODO Investigate why =enable_exception_trace= doesn't work
   :LOGBOOK:
   CLOCK: [2021-02-18 Thu 07:50]--[2021-02-18 Thu 08:18] =>  0:28
   :END:
   I may be misusing the API. It is confusing.

** TODO Translate ITM timestamps to absolute [80%]
   :LOGBOOK:
   CLOCK: [2021-02-19 Fri 09:02]--[2021-02-19 Fri 09:13] =>  0:11
   :END:
   That is, in this output
   #+begin_src fundamental
     ExceptionTrace { exception: ExternalInterrupt(22), action: Entered }
     TimeStamp { tc: 0, ts: 1627 }
     ExceptionTrace { exception: ExternalInterrupt(24), action: Entered }
     TimeStamp { tc: 0, ts: 183 }
     ExceptionTrace { exception: ExternalInterrupt(24), action: Exited }
     TimeStamp { tc: 0, ts: 1078 }
     ExceptionTrace { exception: ExternalInterrupt(23), action: Entered }
     TimeStamp { tc: 0, ts: 3 }
     ExceptionTrace { exception: ExternalInterrupt(23), action: Exited }
     TimeStamp { tc: 0, ts: 565 }
     ExceptionTrace { exception: ExternalInterrupt(22), action: Returned }
     TimeStamp { tc: 0, ts: 7 }
     Sync
     ExceptionTrace { exception: ExternalInterrupt(256), action: Returned }
     ItmData { id: 15, payload: [192, 255] }
     ItmData { id: 15, payload: [0, 0] }
     Sync
     ExceptionTrace { exception: ExternalInterrupt(256), action: Exited }
   #+end_src
   we want to filter out the relative (from when the target started)
   ~TimeStamp~ packets and generate absolute timestamps we can attach to
   all other packets.

*** DONE Read up on the ITM packet protocol
    CLOSED: [2021-02-19 Fri 14:32]
    :LOGBOOK:
    CLOCK: [2021-02-19 Fri 09:23]--[2021-02-19 Fri 10:49] =>  1:26
    :END:
    The packet protocol is described in [[pdf:~/exjobb/docs/DDI0403E_d_armv7m_arm.pdf::779++0.23][DDI0403E_d_armv7m_arm.pdf: Page
    779]].

    Notes:
    - If we want to provide an absolute timestamp (e.g. UNIX time, but
      also in nano-seconds) and save the bytesteam for later then we
      need to inject non-standard bytes into the local sink file.
    - If higher prio trace data uses all trace output bandwidth, ITM
      cannot output timestamp packets.

*** DONE Investigate to what degree probe-rs decodes packets
    CLOSED: [2021-02-19 Fri 14:33]
    :LOGBOOK:
    CLOCK: [2021-02-19 Fri 11:06]--[2021-02-19 Fri 11:25] =>  0:19
    CLOCK: [2021-02-19 Fri 10:49]--[2021-02-19 Fri 10:51] =>  0:02
    :END:

    These is no symblic diff between global and local timestamps.

    The decoder is surface-level, and there is no assoc of timestamps to
    other packets. A new crate should be created.

*** DONE Extend itm-decode to associate timestamp to data
    CLOSED: [2021-03-13 Sat 06:48]
    :LOGBOOK:
    CLOCK: [2021-02-23 Tue 11:40]--[2021-02-23 Tue 12:29] =>  0:49
    CLOCK: [2021-02-22 Mon 14:06]--[2021-02-22 Mon 15:45] =>  1:39
    CLOCK: [2021-02-22 Mon 11:29]--[2021-02-22 Mon 12:50] =>  1:21
    CLOCK: [2021-02-22 Mon 10:55]--[2021-02-22 Mon 11:24] =>  0:29
    CLOCK: [2021-02-20 Sat 09:30]--[2021-02-20 Sat 11:29] =>  1:59
    CLOCK: [2021-02-20 Sat 08:43]--[2021-02-20 Sat 09:08] =>  0:25
    CLOCK: [2021-02-20 Sat 08:29]--[2021-02-20 Sat 08:43] =>  0:14
    CLOCK: [2021-02-19 Fri 15:36]--[2021-02-19 Fri 16:40] =>  1:04
    :END:
    A global timestamp value is transmitted using a GTS1 and GTS2
    packet.

    Additionally, we need to handle Sync packets.

    Repo can be found at https://github.com/tmplt/itm-decode.

    - [2021-02-20 Sat] :: A new crate skeleton has replaced the previous
      code base. Next up it to copy =itm.bin= from ~itm-tools~, and make
      sure our bitmatch patterns work as expected.

*** TODO Verify that ITM output is expected [2/6]
    :LOGBOOK:
    CLOCK: [2021-02-23 Tue 15:16]--[2021-02-23 Tue 16:21] =>  1:05
    CLOCK: [2021-02-23 Tue 12:30]--[2021-02-23 Tue 14:07] =>  1:37
    CLOCK: [2021-02-23 Tue 11:40]--[2021-02-23 Tue 12:29] =>  0:49
    :END:

